recipes/peanut-chilli-noodles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Peanut Chilli Noodles</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Peanut Chilli Noodles</h1>
<p>
<a href="https://www.youtube.com/watch?v=mfs_ykCaqfg2">Original link</a>
</p>

<div id="outline-container-org65422c5" class="outline-2">
<h2 id="org65422c5">Ingredients</h2>
<div class="outline-text-2" id="text-org65422c5">
<ul class="org-ul">
<li>1 handful cremini or button mushrooms</li>
<li>2 pieces garlic</li>
<li>1 small piece ginger</li>
<li>2 sticks green onion</li>
<li>100g extra firm tofu</li>
<li>1 bundle udon noodles</li>
<li>drizzle of toasted sesame oil</li>
<li>3 tbsp chili oil (<a href="./homemade-chilli-oil.html">Homemade chilli oil</a>)</li>
<li>1 small bunch canned bamboo</li>
<li>1/4 cup corn</li>
<li>1 tbsp peanut butter</li>
<li>2 tbsp soy sauce</li>
<li>1/2 cup water</li>
<li>2 tbsp crushed roasted peanuts</li>
<li>1 tbsp white sesame seeds</li>
</ul>
</div>
</div>

<div id="outline-container-orgcf4f863" class="outline-2">
<h2 id="orgcf4f863">Method</h2>
<div class="outline-text-2" id="text-orgcf4f863">
<ol class="org-ol">
<li>Bring a pot of water to boil for the noodles</li>
<li>Quarter the mushrooms.  Finely chop the garlic and ginger.  Chop the green onion leaving some of the green part for garnish</li>
<li>Use a paper towel to dry off the tofu.  Then, crumble and set aside</li>
<li>Cook the noodles for half the time to package instructions (in this case 4min)</li>
<li>When the noodles are cooked, strain out the water and toss with a drizzle of toasted sesame oil</li>
<li>Heat up a saute pan on medium heat</li>
<li>Add the chili oil.  Then, saute the garlic, ginger, and green onion for about 1min</li>
<li>Add the tofu and bamboo.  Saute for a few minutes</li>
<li>Add the mushrooms, corn, peanut butter, soy sauce, and the noodles</li>
<li>Add the 1/2 cup water and stir until the noodles have absorbed the liquid (few minutes)</li>
<li>Garnish with the rest of the green onion, peanuts, the white sesame seeds, and an optional drizzle of chili oil</li>
</ol>
</div>
</div>
</div>
</body>
</html>
